In [5]:
import pandas as pd

pandas read data in two formats
1.DataFrame:-Dataframe is nothing but a kind of structured data(Structure means having proper row and column
2.Series

In [6]:
#to read a csv format
draft1=pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex1.csv")
draft1.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
#to read tabseprated dataset i.e., tsv format
draft2=pd.read_table("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/test.tsv")
draft2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [8]:
# Suppose if u dont have a header data would be like ds
#by default header=infer, infer means it will try to consider aumatically that you have header
pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex1.csv",header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [9]:
#I want to give my own cutome header 
#for that we have parameter called names in the names we can specify our column names
pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex1.csv",names=['p','r','a','d','reddy'])

   p   r   a   d    reddy
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [10]:
#if you give extra column name it will create extra column as well
pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex1.csv",names=['p','r','a','d','reddy','varigi'])

   p   r   a   d    reddy  varigi
0  a   b   c   d  message     NaN
1  1   2   3   4    hello     NaN
2  5   6   7   8    world     NaN
3  9  10  11  12      foo     NaN

In [11]:
# if we want to read dataset which have multiple indexes
pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/csv_mindex.csv")

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [12]:
parsed=pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/csv_mindex.csv",index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
!cat file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex4.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [14]:
pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex4.csv")

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [15]:
#Skiprows parameter is for removeing unwanted data from dataset
pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex4.csv",skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
#isnull is basically try to give you true are false where ever there will be null vlaues there it will print True
result=pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [18]:
#na_values: where ever ther is a null vlaue it is going to fill all o those values with NaN
result=pd.read_csv("file:///F:/Pyhton Courses/ineuron/code_pandas1/examples/ex5.csv",na_values=["NULL"])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

Reading the excel sheet

In [19]:
#sheetname : inside the excel sheet we do have different sheets avilable i would like to read all of those sheet sepratly
#draft3=pd.read_excel("path",sheetname='name')

Reading data from html file

In [20]:
url="https://www.basketball-reference.com/leagues/NBA_2017_totals.html"
BB_data=pd.read_html(url)
#here iam trying to get index zero i.e(BB_data[0])ix is always try to filter rows and columns
#ix[:,0:20]: iam looking for all the rows and iam looking for all the columns from 0 index to till 20 index 
BB_data[0:]

[      Rk             Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  \
 0      1       Álex Abrines  SG  23  OKC  68   6  1055  134  341  ...  .898
 1      2         Quincy Acy  PF  26  TOT  38   1   558   70  170  ...  .750
 2      2         Quincy Acy  PF  26  DAL   6   0    48    5   17  ...  .667
 3      2         Quincy Acy  PF  26  BRK  32   1   510   65  153  ...  .754
 4      3       Steven Adams   C  23  OKC  80  80  2389  374  655  ...  .611
 ..   ...                ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...
 614  482        Cody Zeller   C  24  CHO  62  58  1725  253  443  ...  .679
 615  483       Tyler Zeller   C  27  BOS  51   5   525   78  158  ...  .564
 616  484  Stephen Zimmerman   C  20  ORL  19   0   108   10   31  ...  .600
 617  485        Paul Zipser  SF  22  CHI  44  18   843   88  221  ...  .775
 618  486        Ivica Zubac   C  19  LAL  38  11   609  126  238  ...  .653

      ORB  DRB  TRB AST STL BLK  TOV   PF  PTS
 0     18   68   86  40  37   8   33  114  406
 1     20   95  115  18  14  15   21   67  222
 2      2    6    8   0   0   0    2    9   13
 3     18   89  107  18  14  15   19   58  209
 4    281  332  613  86  89  78  146  195  905
 ..   ...  ...  ...  ..  ..  ..  ...  ...  ...
 614  135  270  405  99  62  58   65  189  639
 615   43   81  124  42   7  21   20   61  178
 616   11   24   35   4   2   5    3   17   23
 617   15  110  125  36  15  16   40   78  240
 618   41  118  159  30  14  33   30   66  284

 [619 rows x 30 columns]]

In [21]:
BB_data.head(5)

AttributeError: 'list' object has no attribute 'head'

getting Data from github repository

titanic_train=pd.read_csv("githubpath",sep="\t")#\t which nothing but tab seprator

In [ ]:
titanic_train=pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",sep='\t')

In [ ]:
titanic_train

In [ ]:
titanic_train.head()

if i wanted to extract particular column or perticular row                                                                      
Syntax:                                                                                                                              
     DataframeName[['column name1','column name2'.......]].head()

In [ ]:
titanic_train[['Name','Pclass']].head()

dtype: it is going to give how pandas to understand each and every column datatype

In [ ]:
titanic_train.dtypes

In [ ]:
result=pd.read_csv("F:/Pyhton Courses/ineuron/code_pandas1/examples/ex6.csv")
result

In [ ]:
#nrows means number of rows
pd.read_csv("F:/Pyhton Courses/ineuron/code_pandas1/examples/ex6.csv",nrows=5)

chunksize=1000(which is going to read or take 1000 kb from the dataset

In [ ]:
chunk=pd.read_csv("F:/Pyhton Courses/ineuron/code_pandas1/examples/ex6.csv",chunksize=1000)
chunk

# writing data to text format

In [ ]:
data=pd.read_csv("F:/Pyhton Courses/ineuron/code_pandas1/examples/ex5.csv")
data

In [ ]:
data.to_csv("C:/Users/Pradeep/Desktop/out.csv")

In [ ]:
data2=pd.read_csv("C:/Users/Pradeep/Desktop/out.csv")
data2

In [ ]:
import sys
data.to_csv(sys.stdout,sep='|')

In [ ]:
data.to_csv("C:/Users/Pradeep/Desktop/out2.csv",sep='@')

na_rep='NULL',means replace empty value with null value

In [ ]:
data.to_csv(sys.stdout,na_rep='NULL')

if you dont want to store header and index then make index=Flase header=Flase

In [ ]:
data.to_csv(sys.stdout,index=False,header=False)

In [ ]:
data.to_csv("C:/Users/Pradeep/Desktop/out3.csv",index=False,header=False)

In [ ]:
# don't consider index consider my column
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

In [ ]:
data.to_csv("C:/Users/Pradeep/Desktop/out4.csv",index=False,columns=['a','b','c'])

In [ ]:
import numpy as np

In [ ]:
dates=pd.date_range('1/1/2000',periods=7)# Here i just want to create a date range with a period of 7
ts=pd.Series(np.arange(7),index=dates)
ts.to_csv("C:/Users/Pradeep/Desktop/tseries.csv")
ts

working with Delimated formats

In [23]:
import csv
#reader always try to store objects
f=open('F:/Pyhton Courses/ineuron/code_pandas1/examples/ex7.csv')
reader=csv.reader(f)
reader

In [ ]:
for line in reader:#it will print each and ever element in the form of list
    print(line)

In [32]:
#zip function: Zip always try to write tuple
names=("pradeep","Shiva","Raghava")
comp=("Infosys","Accenture","Govt")
zipped=zip(names,comp)
print(zipped)
zipped_lis=list(zipped)
print(zipped_lis)
Zipped_set=set(zip(names,comp))
print(Zipped_set)

<zip object at 0x000001B1BDEE9588>
[('pradeep', 'Infosys'), ('Shiva', 'Accenture'), ('Raghava', 'Govt')]
{('pradeep', 'Infosys'), ('Shiva', 'Accenture'), ('Raghava', 'Govt')}

In [ ]:
names=("pradeep","Shiva","Raghava")
comp=("Infosys","Accenture","Govt")
zipped=zip(names,comp)
for (names,comp) in zipped:
    print(names,comp)

In [25]:
for line in reader:#it will print each and ever element in the form of list
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [24]:
with open('F:/Pyhton Courses/ineuron/code_pandas1/examples/ex7.csv') as f:
    lines=list(csv.reader(f))

In [30]:
header, values =lines[0],lines[1:]

In [31]:
data_dict={h:v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

# jason dataset

In [41]:
obj="""
{"name":"wes",
 "places_lived":["U.S.A","Spain","Germany"],
  "pets":null,
  "siblings":[{"name":"scott","age":30,"pets":["Zeus","Zuko"]},
              {"name":"katie","age":38, "pets":["Sixes","Stache","Casco"]}]
                

}
"""

In [42]:
import json
result=json.loads(obj)#reading the jason dataset
result

{'name': 'wes',
 'places_lived': ['U.S.A', 'Spain', 'Germany'],
 'pets': None,
 'siblings': [{'name': 'scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Casco']}]}

In [44]:
#if i want to store this data set  some where
asjson=json.dumps(result)
asjson

'{"name": "wes", "places_lived": ["U.S.A", "Spain", "Germany"], "pets": null, "siblings": [{"name": "scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "katie", "age": 38, "pets": ["Sixes", "Stache", "Casco"]}]}'

In [49]:
#here i am trying to create a dataframe so what ever the the result we will able to get still it is not avilable in the readble format
#so what i am doing here what ever the  result we will get as of now
siblings=pd.DataFrame(result['siblings'],columns=['name','age','pets'])
siblings

    name  age                    pets
0  scott   30            [Zeus, Zuko]
1  katie   38  [Sixes, Stache, Casco]

In [50]:
data=pd.read_json('F:/Pyhton Courses/ineuron/code_pandas1/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# XML and HTML webscraping

In [64]:
tables=pd.read_html("F:/Pyhton Courses/ineuron/code_pandas1/examples/fdic_failed_bank_list.html")
len(tables)
failures=tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [63]:
#if i wanted to get a datatype
failures.dtypes

Bank Name                object
City                     object
ST                       object
CERT                      int64
Acquiring Institution    object
Closing Date             object
Updated Date             object
dtype: object

In [68]:
#Here closingDate is avilbale as a object type i.e string type which would be the date type
#so i want to convert it to date format
close_timestamp=pd.to_datetime(failures['Closing Date'])#By default it will convert string format to dateformat
close_timestamp

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [69]:
close_timestamp.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

# Binary Dataformats

In [70]:
#Binary Dataformat is a kind of a file which you serilize or deserilize
#object to binary converstion is called serilize
#binary to object is deserilizetion

#pickle is basically a python Binaryformat

In [72]:
Frame=pd.read_csv("F:/Pyhton Courses/ineuron/code_pandas1/examples/ex1.csv")
Frame
Frame.to_pickle("C:/Users/Pradeep/Desktop/frame_pickle")

In [73]:
pd.read_pickle("C:/Users/Pradeep/Desktop/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Reading Data from webAPI

In [75]:
import requests
url='https://api.github.com/repos/pandas-dev/pandas/issues'
resp=requests.get(url)
resp

In [79]:
data=resp.json()
data[0]['title']  #read or load all the data from zero index but only show me the title

'BUG: maximum of pd.Series([np.nan],dtype=ordered_category) raise'

In [81]:
data[0]["user"]

{'login': 'mizuy',
 'id': 282477,
 'node_id': 'MDQ6VXNlcjI4MjQ3Nw==',
 'avatar_url': 'https://avatars0.githubusercontent.com/u/282477?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/mizuy',
 'html_url': 'https://github.com/mizuy',
 'followers_url': 'https://api.github.com/users/mizuy/followers',
 'following_url': 'https://api.github.com/users/mizuy/following{/other_user}',
 'gists_url': 'https://api.github.com/users/mizuy/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/mizuy/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/mizuy/subscriptions',
 'organizations_url': 'https://api.github.com/users/mizuy/orgs',
 'repos_url': 'https://api.github.com/users/mizuy/repos',
 'events_url': 'https://api.github.com/users/mizuy/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/mizuy/received_events',
 'type': 'User',
 'site_admin': False}

In [82]:
#if i want to get it from second index from the user
data[2]["user"]

{'login': 'AlexKirko',
 'id': 23253999,
 'node_id': 'MDQ6VXNlcjIzMjUzOTk5',
 'avatar_url': 'https://avatars1.githubusercontent.com/u/23253999?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/AlexKirko',
 'html_url': 'https://github.com/AlexKirko',
 'followers_url': 'https://api.github.com/users/AlexKirko/followers',
 'following_url': 'https://api.github.com/users/AlexKirko/following{/other_user}',
 'gists_url': 'https://api.github.com/users/AlexKirko/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/AlexKirko/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/AlexKirko/subscriptions',
 'organizations_url': 'https://api.github.com/users/AlexKirko/orgs',
 'repos_url': 'https://api.github.com/users/AlexKirko/repos',
 'events_url': 'https://api.github.com/users/AlexKirko/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/AlexKirko/received_events',
 'type': 'User',
 'site_admin': False}

In [83]:
#here iam trying to fetch data
data=pd.DataFrame(data,columns=['number','title','labels','state'])
data

,number,title,labels,state
0,33450,"BUG: maximum of pd.Series([np.nan],dtype=order...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,33449,BUG: Series.any/all with level keyword should ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,33448,Whitelist std and var for use with custom roll...,[],open
3,33447,REF: de-nest Series getitem/setitem checks,[],open
4,33446,BUG: Fix ValueError when grouping by read-only...,[],open
5,33445,REF: remove replace_list kludge,[],open
6,33444,DOC: Fix heading capitalization in doc/source/...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
7,33443,BUG: Low performance of DataFrame operations,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
8,33442,ENH: Add prod to masked_reductions,"[{'id': 1817503692, 'node_id': 'MDU6TGFiZWwxOD...",open
9,33441,BUG: Timedelta == ndarray[td64],"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
10,33440,BUG: `weights` is not working for multiple col...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,33439,BUG: Mysterious Series.get() with Int64Index bug,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
12,33438,BUG: Inconsistent behavior of pd.DataFrame.drop,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,33437,BUG: DataFrame constructor doesn't validate in...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,33436,BUG: Fix bug when concatenating Index of strings,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
15,33435,To numeric,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
16,33434,tm.external_error_raised instead of tm.assertR...,[],open
17,33433,BUG: Using `kwargs` in `Rolling.apply()`,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,33432,remove flake8-rst cap,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
19,33429,DOC: Fix heading capitalization in doc/source/...,[],open
20,33428,DOC: Data links in Pandas API Reference are br...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
21,33427,CLN: avoid accessing private functions,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
22,33426,BUG: core.missing._akima_interpolate will rais...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
23,33425,BUG: str.cat produces NaNs when others is an I...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
24,33420,BUG: set_levels set wrong order levels for Mut...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,33418,lreshape and wide_to_long documentation (Close...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
26,33417,DOC: lreshape and wide_to_long references,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
27,33415,WIP: Timestamp/DTA match stdlib tzawareness-co...,[],open
28,33414,ENH: Optionally pass dtypes as a dict into jso...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,33410,BUG: ValueError: buffer source array is read-o...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

# Interacting with database i.e how you are getting data from database

In [84]:
import sqlite3

In [86]:
db=sqlite3.connect("my_database4.db")#Here creating the database
db

In [88]:
#Drop table if it already exists using execute method
db.execute("drop table if exists test")#Heere test is table

In [92]:
query="""
CREATE TABLE test
(a VARCHAR(20),b VARCHAR(20),
 c REAL, d INTEGER);"""
con=sqlite3.connect('mydata2.sqlite')#Here again iam creating  the another database
con.execute(query)#Here iam execting the query
con.commit()#and then iam going to commit it
#note: mydata.sqlite or mydata.db(i.e .sqlite,.db) any thing is fine

In [93]:
data=[('Atlanta','Georgia',1.25,6),
      ('Tallahasse','Florida',2.6,3),
     ('Sacramento','California',1.7,5)]
stmt="INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt,data)
con.commit()

In [94]:
cursor=con.execute('select * from test')
rows=cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [95]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [98]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description ])

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5

In [124]:
#How to insert values in to the dataframe
import sqlite3
db=sqlite3.connect("mydata6.db")
#Drop table if it already exists using execute() method
db.execute("drop table if exists grades1")
#create a table as per our requirment
db.execute("create table grades1(id int,name text,score int)")
#insering a values inside the table
db.execute("insert into grades1(id,name,score) values(101,'John',991)")
db.execute("insert into grades1(id,name,score) values(102,'Pradeep',992)")
db.execute("insert into grades1(id,name,score) values(103,'Shiva',993)")
db.execute("insert into grades1(id,name,score) values(104,'Raghu',994)")
db.execute("insert into grades1(id,name,score) values(105,'Sai',995)")
db.execute("insert into grades1(id,name,score) values(106,'Naveen',996)")

OperationalError: database is locked

In [ ]:
db.commit()

In [ ]:
result=db.execute("select * from grades1 order by id")
for rows in result:
    print((rows))
print("-"*60)

In [125]:
result2=db.execute("select * from grades1 where name = 'Pradeep' ")    
for rows in result2:
    print(rows)
print("-"*60)

(102, 'Pradeep', 992)
------------------------------------------------------------

In [126]:
result3=db.execute("select * from grades1 where score>=90 ") 
for rows in result3:
    print(rows)

(101, 'John', 991)
(102, 'Pradeep', 992)
(103, 'Shiva', 993)
(104, 'Raghu', 994)
(105, 'Sai', 995)
(106, 'Naveen', 996)

In [127]:
pwd

'C:\\Users\\Pradeep'